# FarDistance Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Camera..::..FarDistance Property
Camera Class See Also
---
Distance to far clipping plane
**Namespace:** Autodesk.Revit.DB.DirectContext3D**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public double FarDistance { get; set; }
```

Visual Basic
---
```text
Public Property FarDistance As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double FarDistance {
	double get ();
	void set (double value);
}
```

# See Also
Camera Class
Autodesk.Revit.DB.DirectContext3D Namespace